# About Dataset

## Bank Customer Segmentation
Most banks have a large customer base - with different characteristics in terms of age, income, values lifestyle, and more. Customer segmentation is the process of dividing a customer dataset into specific groups based on shared traits.

According to a report from Ernst & Young, â€œA more granular understanding of consumers is no longer nice-to-have item, but a strategic and competitive imperative for banking providers. Customer understanding should be a living, breathing part of everyday business, with insights underpinning the full range of banking operations.

## About this Dataset
This dataset consists of 1 Million+ transaction by over 800K customers for a bank in India. The data contains information such as - customer age (DOB), location, gender, account balance at the time of the transaction, transaction details, transaction amount, etc.

Link: https://www.kaggle.com/datasets/shivamb/bank-customer-segmentation/code?datasetId=1672910&sortBy=voteCount

## Interesting Analysis Ideas
The dataset can be used for different analysis, example -

1. Perform Clustering / Segmentation on the dataset and identify popular customer groups along with their definitions/rules
2. Perform Location-wise analysis to identify regional trends in India
3. Perform transaction-related analysis to identify interesting trends that can be used by a bank to improve / optimize their user experiences
4. Customer Recency, Frequency, Monetary analysis
5. Network analysis or Graph analysis of customer data.

# EDA

## Import required modules

In [72]:
import numpy as np
import pandas as pd
import seaborn
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

## Import and display the data

In [73]:
df = pd.read_csv('data/bank_transactions.csv')
df.head(20)

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.00
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.00
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.00
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.00
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.50
5,T6,C1536588,8/10/72,F,ITANAGAR,53609.20,2/8/16,173940,676.00
6,T7,C7126560,26/1/92,F,MUMBAI,973.46,2/8/16,173806,566.00
7,T8,C1220223,27/1/82,M,MUMBAI,95075.54,2/8/16,170537,148.00
8,T9,C8536061,19/4/88,F,GURGAON,14906.96,2/8/16,192825,833.00
9,T10,C6638934,22/6/84,M,MUMBAI,4279.22,2/8/16,192446,289.11
10,T11,C5430833,22/7/82,M,MOHALI,48429.49,2/8/16,204133,259.00
11,T12,C6939838,7/7/88,M,GUNTUR,14613.46,2/8/16,205108,202.00
12,T13,C6339347,13/6/78,M,AHMEDABAD,32274.78,2/8/16,203834,12300.00
13,T14,C8327851,5/1/92,F,THANE,59950.44,1/8/16,84706,50.00
14,T15,C7917151,24/3/78,M,PUNE,10100.84,1/8/16,82253,338.00
15,T16,C8334633,10/7/68,F,NEW DELHI,1283.12,1/8/16,125725,250.00
16,T17,C1376215,1/1/1800,M,MUMBAI,77495.15,1/8/16,124727,1423.11
17,T18,C8967349,16/7/89,M,MUMBAI,2177.85,1/8/16,124734,54.00
18,T19,C3732016,11/1/91,M,MUMBAI,32816.17,1/8/16,122135,315.00
19,T20,C8999019,24/6/85,M,PUNE,10643.50,1/8/16,152821,945.00

## Data Checks to perform
Check Missing values
Check Duplicates
Check data type
Check the number of unique values of each column
Check statistics of data set
Check various categories present in the different categorical column

## Missing Values

In [74]:
df.shape

(1048567, 9)

In [75]:
df.isna().sum()

TransactionID                 0
CustomerID                    0
CustomerDOB                3397
CustGender                 1100
CustLocation                151
CustAccountBalance         2369
TransactionDate               0
TransactionTime               0
TransactionAmount (INR)       0
dtype: int64

In [76]:
df.dropna(inplace=True)

In [77]:
df.isna().sum()

TransactionID              0
CustomerID                 0
CustomerDOB                0
CustGender                 0
CustLocation               0
CustAccountBalance         0
TransactionDate            0
TransactionTime            0
TransactionAmount (INR)    0
dtype: int64

## Check duplicates

In [78]:
df.duplicated().sum()

0

## Check Datatypes

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1041614 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1041614 non-null  object
 1   CustomerID               1041614 non-null  object
 2   CustomerDOB              1041614 non-null  object
 3   CustGender               1041614 non-null  object
 4   CustLocation             1041614 non-null  object
 5   CustAccountBalance       1041614 non-null  float64
 6   TransactionDate          1041614 non-null  object
 7   TransactionTime          1041614 non-null  int64
 8   TransactionAmount (INR)  1041614 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 79.5+ MB

## Check Unique Values

In [80]:
df.nunique()

TransactionID              1041614
CustomerID                  879358
CustomerDOB                  17233
CustGender                       3
CustLocation                  9275
CustAccountBalance          160723
TransactionDate                 55
TransactionTime              81855
TransactionAmount (INR)      92391
dtype: int64

## Statistics

In [81]:
df.describe()

       CustAccountBalance  TransactionTime  TransactionAmount (INR)
count        1.041614e+06     1.041614e+06             1.041614e+06
mean         1.149986e+05     1.571221e+05             1.566096e+03
std          8.467609e+05     5.126352e+04             6.561464e+03
min          0.000000e+00     0.000000e+00             0.000000e+00
25%          4.728140e+03     1.240410e+05             1.600000e+02
50%          1.676852e+04     1.642470e+05             4.575000e+02
75%          5.742885e+04     2.000220e+05             1.200000e+03
max          1.150355e+08     2.359590e+05             1.560035e+06

## Cleaning

## change dob and transaction date dtypes

In [82]:
df['CustomerDOB'] = pd.to_datetime(df['CustomerDOB'])
df['TransactionDate'] = pd.to_datetime(df['TransactionDate'])
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0
1,T2,C2142763,2057-04-04,M,JHAJJAR,2270.69,2016-02-08,141858,27999.0
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,142712,459.0
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,142714,2060.0
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,181156,1762.5

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1041614 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1041614 non-null  object
 1   CustomerID               1041614 non-null  object
 2   CustomerDOB              1041614 non-null  datetime64[ns]
 3   CustGender               1041614 non-null  object
 4   CustLocation             1041614 non-null  object
 5   CustAccountBalance       1041614 non-null  float64
 6   TransactionDate          1041614 non-null  datetime64[ns]
 7   TransactionTime          1041614 non-null  int64
 8   TransactionAmount (INR)  1041614 non-null  float64
dtypes: datetime64[ns](2), float64(2), int64(1), object(4)
memory usage: 79.5+ MB

In [84]:
df['CustomerAge'] = df['TransactionDate'].dt.year - df['CustomerDOB'].dt.year
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),CustomerAge
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0,22
1,T2,C2142763,2057-04-04,M,JHAJJAR,2270.69,2016-02-08,141858,27999.0,-41
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,142712,459.0,20
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,142714,2060.0,43
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,181156,1762.5,28

In [85]:
df.drop('TransactionTime', axis=1, inplace=True)

In [86]:
df['CustGender'].value_counts()

M    760978
F    280635
T         1
Name: CustGender, dtype: int64

In [87]:
df.drop(df[df['CustGender'] == 'T'].index, inplace=True)

## RFM Analysis

In [88]:
df['TransactionDate'].max()

Timestamp('2016-12-09 00:00:00')

In [89]:
df['TransactionDate1']=df['TransactionDate']

In [90]:
rfm_df = df.groupby('CustomerID').agg(
    {
        "TransactionDate1":"max",
        "TransactionID" : "count",
        "TransactionAmount (INR)" : "sum",
    }
)
rfm_df.reset_index()
rfm_df.head()

           TransactionDate1  TransactionID  TransactionAmount (INR)
CustomerID
C1010011         2016-09-26              2                   5106.0
C1010012         2016-08-14              1                   1499.0
C1010014         2016-07-08              2                   1455.0
C1010018         2016-09-15              1                     30.0
C1010024         2016-08-18              1                   5000.0

In [91]:
rfm_df.shape

(879357, 3)

In [92]:
rfm_df['Recency'] = df['TransactionDate'].max() - rfm_df['TransactionDate1']
rfm_df['Recency'] = rfm_df['Recency'].dt.days
rfm_df.drop('TransactionDate1', axis=1, inplace=True)
rfm_df.columns = ['Frequency', 'Monetary', 'Recency']
rfm_df.head()

            Frequency  Monetary  Recency
CustomerID
C1010011            2    5106.0       74
C1010012            1    1499.0      117
C1010014            2    1455.0      154
C1010018            1      30.0       85
C1010024            1    5000.0      113

In [97]:
rfm_df['r_quartile'] = pd.qcut(rfm_df['Recency'], 5, [5, 4, 3, 2, 1])
rfm_df['m_quartile'] = pd.qcut(rfm_df['Monetary'], 5, [1, 2, 3, 4, 5])
rfm_df

            Frequency  Monetary  Recency r_quartile m_quartile  rfm_score
CustomerID
C1010011            2    5106.0       74          5          5        521
C1010012            1    1499.0      117          2          4        212
C1010014            2    1455.0      154          2          4        222
C1010018            1      30.0       85          4          1        415
C1010024            1    5000.0      113          3          5        311
...               ...       ...      ...        ...        ...        ...
C9099836            1     691.0      154          2          3        213
C9099877            1     222.0       85          4          2        414
C9099919            1     126.0      113          3          1        315
C9099941            1      50.0      103          4          1        415
C9099956            1     855.0       75          5          4        512

[879357 rows x 6 columns]

In [98]:
rfm_df['rfm_score'] = rfm_df.r_quartile.astype(str)+ rfm_df.Frequency.astype(str) + rfm_df.m_quartile.astype(str)
rfm_df['rfm_score'] = rfm_df['rfm_score'].astype(int)
rfm_df.head()

            Frequency  Monetary  Recency r_quartile m_quartile  rfm_score
CustomerID
C1010011            2    5106.0       74          5          5        525
C1010012            1    1499.0      117          2          4        214
C1010014            2    1455.0      154          2          4        224
C1010018            1      30.0       85          4          1        411
C1010024            1    5000.0      113          3          5        315

### Most Valuable Customers

In [99]:
rfm_df.sort_values('rfm_score', ascending=False).where(rfm_df['rfm_score'] >= 444)

            Frequency  Monetary  Recency r_quartile m_quartile  rfm_score
CustomerID
C5418253          6.0   5722.78      1.0          5          5      565.0
C6222360          6.0   5825.00      0.0          5          5      565.0
C4513786          6.0  12800.00     61.0          5          5      565.0
C6735477          6.0   2504.00      0.0          5          5      565.0
C7537344          6.0  21597.50      0.0          5          5      565.0
...               ...       ...      ...        ...        ...        ...
C7730325          NaN       NaN      NaN        NaN        NaN        NaN
C4013143          NaN       NaN      NaN        NaN        NaN        NaN
C6890362          NaN       NaN      NaN        NaN        NaN        NaN
C5722139          NaN       NaN      NaN        NaN        NaN        NaN
C1275570          NaN       NaN      NaN        NaN        NaN        NaN

[879357 rows x 6 columns]